Can't convert Sketch to Rebar Shape.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotConvertSketch { get; }
  Visual Basic
Public Shared ReadOnly Property CannotConvertSketch As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotConvertSketch {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace